app/controllers/tasks_controller.rb

SELECT COUNT(DISTINCT "tasks"."id") FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]
SELECT DISTINCT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."created_at" >= '2018-12-11 15:00:00' ORDER BY "tasks"."created_at" DESC  [["user_id", 2]]
---
  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page]).per(30)