app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "検索用1"], ["description", "ほげ"], ["created_at", "2018-12-12 13:23:34.561016"], ["updated_at", "2018-12-12 13:23:34.561016"], ["user_id", 2]]

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 15], ["LIMIT", 1]]