app/models/task.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "餃子を作る"], ["description", "160個作る"], ["created_at", "2018-12-15 07:14:52.341421"], ["updated_at", "2018-12-15 07:14:52.341421"], ["user_id", 2]]
---
      task = Task.new
      task.attributes = row.to_hash.slice("name", "description", "created_at", "updated_at")
      task.save!